GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p16F13125.inc
;----- IOCAN Bits -----------------------------------------------------
IOCAN0           EQU  H'0000'
IOCAN1           EQU  H'0001'
IOCAN2           EQU  H'0002'
IOCAN3           EQU  H'0003'
IOCAN4           EQU  H'0004'
IOCAN5           EQU  H'0005'


;----- IOCAF Bits -----------------------------------------------------
IOCAF0           EQU  H'0000'
IOCAF1           EQU  H'0001'
IOCAF2           EQU  H'0002'
IOCAF3           EQU  H'0003'
IOCAF4           EQU  H'0004'
IOCAF5           EQU  H'0005'


;----- ANSELC Bits -----------------------------------------------------
ANSELC0          EQU  H'0000'
ANSELC1          EQU  H'0001'
ANSELC2          EQU  H'0002'
ANSELC3          EQU  H'0003'
ANSELC4          EQU  H'0004'
ANSELC5          EQU  H'0005'
ANSC0            EQU  H'0000'
ANSC1            EQU  H'0001'
ANSC2            EQU  H'0002'
ANSC3            EQU  H'0003'
ANSC4            EQU  H'0004'
ANSC5            EQU  H'0005'
ANSC6            EQU  H'0006'
ANSC7            EQU  H'0007'


;----- WPUC Bits -----------------------------------------------------
WPUC0            EQU  H'0000'
WPUC1            EQU  H'0001'
WPUC2            EQU  H'0002'
WPUC3            EQU  H'0003'
WPUC4            EQU  H'0004'
WPUC5            EQU  H'0005'


;----- ODCONC Bits -----------------------------------------------------
ODCC0            EQU  H'0000'
ODCC1            EQU  H'0001'
ODCC2            EQU  H'0002'
ODCC3            EQU  H'0003'
ODCC4            EQU  H'0004'
ODCC5            EQU  H'0005'


;----- SLRCONC Bits -----------------------------------------------------
SLRC0            EQU  H'0000'
SLRC1            EQU  H'0001'
SLRC2            EQU  H'0002'
SLRC3            EQU  H'0003'
SLRC4            EQU  H'0004'
SLRC5            EQU  H'0005'


;----- INLVLC Bits -----------------------------------------------------
INLVLC0          EQU  H'0000'
INLVLC1          EQU  H'0001'
INLVLC2          EQU  H'0002'
INLVLC3          EQU  H'0003'
INLVLC4          EQU  H'0004'
INLVLC5          EQU  H'0005'


;----- IOCCP Bits -----------------------------------------------------
IOCCP0           EQU  H'0000'
IOCCP1           EQU  H'0001'
IOCCP2           EQU  H'0002'
IOCCP3           EQU  H'0003'
IOCCP4           EQU  H'0004'
IOCCP5           EQU  H'0005'


;----- IOCCN Bits -----------------------------------------------------
IOCCN0           EQU  H'0000'
IOCCN1           EQU  H'0001'
IOCCN2           EQU  H'0002'
IOCCN3           EQU  H'0003'
IOCCN4           EQU  H'0004'
IOCCN5           EQU  H'0005'


;----- IOCCF Bits -----------------------------------------------------
IOCCF0           EQU  H'0000'
IOCCF1           EQU  H'0001'
IOCCF2           EQU  H'0002'
IOCCF3           EQU  H'0003'
IOCCF4           EQU  H'0004'
IOCCF5           EQU  H'0005'


;----- RC0I2C Bits -----------------------------------------------------
SLEW             EQU  H'0006'


;----- RC1I2C Bits -----------------------------------------------------
SLEW             EQU  H'0006'


;----- STATUS_SHAD Bits -----------------------------------------------------
STATUS_SHAD0     EQU  H'0000'
STATUS_SHAD1     EQU  H'0001'
STATUS_SHAD2     EQU  H'0002'


;----- STKPTR Bits -----------------------------------------------------
STKPTR0          EQU  H'0000'
STKPTR1          EQU  H'0001'
STKPTR2          EQU  H'0002'
STKPTR3          EQU  H'0003'
STKPTR4          EQU  H'0004'


;----- TOSL Bits -----------------------------------------------------
TOSL0            EQU  H'0000'
TOSL1            EQU  H'0001'
TOSL2            EQU  H'0002'
TOSL3            EQU  H'0003'
TOSL4            EQU  H'0004'
TOSL5            EQU  H'0005'
TOSL6            EQU  H'0006'
TOSL7            EQU  H'0007'


;----- TOSH Bits -----------------------------------------------------
TOSH0            EQU  H'0000'
TOSH1            EQU  H'0001'
TOSH2            EQU  H'0002'
TOSH3            EQU  H'0003'
TOSH4            EQU  H'0004'
TOSH5            EQU  H'0005'
TOSH6            EQU  H'0006'
TOSH7            EQU  H'0007'

;==========================================================================
;
;       RAM Definitions
;
;==========================================================================

       __MAXRAM  H'1FFF'
       __BADRAM  H'000E'
       __BADRAM  H'000F'-H'0011'
       __BADRAM  H'0013'
       __BADRAM  H'0015'-H'0017'
       __BADRAM  H'0019'
       __BADRAM  H'001B'-H'001F'
       __BADRAM  H'0094'-H'0095'
       __BADRAM  H'009E'-H'009F'
       __BADRAM  H'0112'-H'011F'
       __BADRAM  H'0194'-H'019B'
       __BADRAM  H'020E'-H'021F'
       __BADRAM  H'0312'-H'031F'
       __BADRAM  H'0392'-H'039F'
       __BADRAM  H'0414'-H'041E'
       __BADRAM  H'048C'-H'049F'
       __BADRAM  H'0511'-H'0514'
       __BADRAM  H'051A'-H'051F'
       __BADRAM  H'058C'-H'059F'
       __BADRAM  H'060C'-H'061F'
       __BADRAM  H'0698'-H'069F'
       __BADRAM  H'0713'-H'0725'
       __BADRAM  H'0793'-H'07A5'
       __BADRAM  H'0814'-H'081E'
       __BADRAM  H'0826'-H'082E'
       __BADRAM  H'088E'-H'08A1'
       __BADRAM  H'090C'-H'091F'
       __BADRAM  H'098C'-H'099F'
       __BADRAM  H'0A0C'-H'0A1F'
       __BADRAM  H'0A8C'-H'0A9F'
       __BADRAM  H'0B0C'-H'0B1F'
       __BADRAM  H'0B8C'-H'0B9F'
       __BADRAM  H'0C0C'-H'0C1F'
       __BADRAM  H'0C8C'-H'0C9F'
       __BADRAM  H'0E0C'-H'0E1F'
       __BADRAM  H'0E8C'-H'0E9F'
       __BADRAM  H'0E0C'-H'0E1F'
       __BADRAM  H'0E8C'-H'0E9F'
       __BADRAM  H'0F0C'-H'0F1F'
       __BADRAM  H'0F8C'-H'0F9F'
       __BADRAM  H'100C'-H'101F'
       __BADRAM  H'108C'-H'109F'
       __BADRAM  H'110C'-H'111F'
       __BADRAM  H'118C'-H'119F'
       __BADRAM  H'120C'-H'121F'
       __BADRAM  H'128C'-H'129F'
       __BADRAM  H'130C'-H'131F'
       __BADRAM  H'138C'-H'139F'
       __BADRAM  H'140C'-H'141F'
       __BADRAM  H'148C'-H'149F'
       __BADRAM  H'150C'-H'151F'
       __BADRAM  H'158C'-H'159F'
       __BADRAM  H'160C'-H'161F'
       __BADRAM  H'168C'-H'169F'
       __BADRAM  H'170C'-H'171F'
       __BADRAM  H'178C'-H'179F'
       __BADRAM  H'180C'-H'181F'
       __BADRAM  H'188C'-H'189F'
       __BADRAM  H'190C'-H'191F'
       __BADRAM  H'198C'-H'199F'
       __BADRAM  H'1A0C'-H'1A1F'
       __BADRAM  H'1A8C'-H'1A9F'
       __BADRAM  H'1B0C'-H'1B1F'
       __BADRAM  H'1B8C'-H'1B9F'
       __BADRAM  H'1C0C'-H'1C1F'
       __BADRAM  H'1C95'
       __BADRAM  H'1C98'
       __BADRAM  H'1C9B'-H'1C9C'
       __BADRAM  H'1E20'
       __BADRAM  H'1E2F'
       __BADRAM  H'1E31'-H'1E6F'
       __BADRAM  H'1E8F'
       __BADRAM  H'1E92'-H'1E9B'
       __BADRAM  H'1EA2'-H'1EEF'
       __BADRAM  H'1E11'-H'1E18'
       __BADRAM  H'1E1A'-H'1E1D'
       __BADRAM  H'1E20'-H'1E3D'
       __BADRAM  H'1E43'-H'1E46'
       __BADRAM  H'1E4A'-H'1E4F'
       __BADRAM  H'1E51'-H'1E56'
       __BADRAM  H'1E94'-H'1E9F'
       __BADRAM  H'1EA8'-H'1EE8'
       __BADRAM  H'1EEB'-H'1EEF'
       __BADRAM  H'1F0F'-H'1F6F'
       __BADRAM  H'1F8C'-H'1FE3'
       __BADRAM  H'1FEC'


